GopalSaraf/Practicals/PSDL/include/proc/pic16lf18446.h
// Register: CK1PPS
#define CK1PPS CK1PPS
extern volatile unsigned char           CK1PPS              __at(0x1ECC);
#ifndef _LIB_BUILD
asm("CK1PPS equ 01ECCh");
#endif
// aliases
extern volatile unsigned char           TX1CKPPS            __at(0x1ECC);
#ifndef _LIB_BUILD
asm("TX1CKPPS equ 01ECCh");
#endif
extern volatile unsigned char           CKPPS               __at(0x1ECC);
#ifndef _LIB_BUILD
asm("CKPPS equ 01ECCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TX1CKPPS               :5;
    };
    struct {
        unsigned TX1CKPPS0              :1;
        unsigned TX1CKPPS1              :1;
        unsigned TX1CKPPS2              :1;
        unsigned TX1CKPPS3              :1;
        unsigned TX1CKPPS4              :1;
    };
} CK1PPSbits_t;
extern volatile CK1PPSbits_t CK1PPSbits __at(0x1ECC);
// bitfield macros
#define _CK1PPS_PIN_POSN                                    0x0
#define _CK1PPS_PIN_POSITION                                0x0
#define _CK1PPS_PIN_SIZE                                    0x3
#define _CK1PPS_PIN_LENGTH                                  0x3
#define _CK1PPS_PIN_MASK                                    0x7
#define _CK1PPS_PORT_POSN                                   0x3
#define _CK1PPS_PORT_POSITION                               0x3
#define _CK1PPS_PORT_SIZE                                   0x2
#define _CK1PPS_PORT_LENGTH                                 0x2
#define _CK1PPS_PORT_MASK                                   0x18
#define _CK1PPS_TX1CKPPS_POSN                               0x0
#define _CK1PPS_TX1CKPPS_POSITION                           0x0
#define _CK1PPS_TX1CKPPS_SIZE                               0x5
#define _CK1PPS_TX1CKPPS_LENGTH                             0x5
#define _CK1PPS_TX1CKPPS_MASK                               0x1F
#define _CK1PPS_TX1CKPPS0_POSN                              0x0
#define _CK1PPS_TX1CKPPS0_POSITION                          0x0
#define _CK1PPS_TX1CKPPS0_SIZE                              0x1
#define _CK1PPS_TX1CKPPS0_LENGTH                            0x1
#define _CK1PPS_TX1CKPPS0_MASK                              0x1
#define _CK1PPS_TX1CKPPS1_POSN                              0x1
#define _CK1PPS_TX1CKPPS1_POSITION                          0x1
#define _CK1PPS_TX1CKPPS1_SIZE                              0x1
#define _CK1PPS_TX1CKPPS1_LENGTH                            0x1
#define _CK1PPS_TX1CKPPS1_MASK                              0x2
#define _CK1PPS_TX1CKPPS2_POSN                              0x2
#define _CK1PPS_TX1CKPPS2_POSITION                          0x2
#define _CK1PPS_TX1CKPPS2_SIZE                              0x1
#define _CK1PPS_TX1CKPPS2_LENGTH                            0x1
#define _CK1PPS_TX1CKPPS2_MASK                              0x4
#define _CK1PPS_TX1CKPPS3_POSN                              0x3
#define _CK1PPS_TX1CKPPS3_POSITION                          0x3
#define _CK1PPS_TX1CKPPS3_SIZE                              0x1
#define _CK1PPS_TX1CKPPS3_LENGTH                            0x1
#define _CK1PPS_TX1CKPPS3_MASK                              0x8
#define _CK1PPS_TX1CKPPS4_POSN                              0x4
#define _CK1PPS_TX1CKPPS4_POSITION                          0x4
#define _CK1PPS_TX1CKPPS4_SIZE                              0x1
#define _CK1PPS_TX1CKPPS4_LENGTH                            0x1
#define _CK1PPS_TX1CKPPS4_MASK                              0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TX1CKPPS               :5;
    };
    struct {
        unsigned TX1CKPPS0              :1;
        unsigned TX1CKPPS1              :1;
        unsigned TX1CKPPS2              :1;
        unsigned TX1CKPPS3              :1;
        unsigned TX1CKPPS4              :1;
    };
} TX1CKPPSbits_t;
extern volatile TX1CKPPSbits_t TX1CKPPSbits __at(0x1ECC);
// bitfield macros
#define _TX1CKPPS_PIN_POSN                                  0x0
#define _TX1CKPPS_PIN_POSITION                              0x0
#define _TX1CKPPS_PIN_SIZE                                  0x3
#define _TX1CKPPS_PIN_LENGTH                                0x3
#define _TX1CKPPS_PIN_MASK                                  0x7
#define _TX1CKPPS_PORT_POSN                                 0x3
#define _TX1CKPPS_PORT_POSITION                             0x3
#define _TX1CKPPS_PORT_SIZE                                 0x2
#define _TX1CKPPS_PORT_LENGTH                               0x2
#define _TX1CKPPS_PORT_MASK                                 0x18
#define _TX1CKPPS_TX1CKPPS_POSN                             0x0
#define _TX1CKPPS_TX1CKPPS_POSITION                         0x0
#define _TX1CKPPS_TX1CKPPS_SIZE                             0x5
#define _TX1CKPPS_TX1CKPPS_LENGTH                           0x5
#define _TX1CKPPS_TX1CKPPS_MASK                             0x1F
#define _TX1CKPPS_TX1CKPPS0_POSN                            0x0
#define _TX1CKPPS_TX1CKPPS0_POSITION                        0x0
#define _TX1CKPPS_TX1CKPPS0_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS0_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS0_MASK                            0x1
#define _TX1CKPPS_TX1CKPPS1_POSN                            0x1
#define _TX1CKPPS_TX1CKPPS1_POSITION                        0x1
#define _TX1CKPPS_TX1CKPPS1_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS1_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS1_MASK                            0x2
#define _TX1CKPPS_TX1CKPPS2_POSN                            0x2
#define _TX1CKPPS_TX1CKPPS2_POSITION                        0x2
#define _TX1CKPPS_TX1CKPPS2_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS2_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS2_MASK                            0x4
#define _TX1CKPPS_TX1CKPPS3_POSN                            0x3
#define _TX1CKPPS_TX1CKPPS3_POSITION                        0x3
#define _TX1CKPPS_TX1CKPPS3_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS3_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS3_MASK                            0x8
#define _TX1CKPPS_TX1CKPPS4_POSN                            0x4
#define _TX1CKPPS_TX1CKPPS4_POSITION                        0x4
#define _TX1CKPPS_TX1CKPPS4_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS4_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS4_MASK                            0x10
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TX1CKPPS               :5;
    };
    struct {
        unsigned TX1CKPPS0              :1;
        unsigned TX1CKPPS1              :1;
        unsigned TX1CKPPS2              :1;
        unsigned TX1CKPPS3              :1;
        unsigned TX1CKPPS4              :1;
    };
} CKPPSbits_t;
extern volatile CKPPSbits_t CKPPSbits __at(0x1ECC);
// bitfield macros
#define _CKPPS_PIN_POSN                                     0x0
#define _CKPPS_PIN_POSITION                                 0x0
#define _CKPPS_PIN_SIZE                                     0x3
#define _CKPPS_PIN_LENGTH                                   0x3
#define _CKPPS_PIN_MASK                                     0x7
#define _CKPPS_PORT_POSN                                    0x3
#define _CKPPS_PORT_POSITION                                0x3
#define _CKPPS_PORT_SIZE                                    0x2
#define _CKPPS_PORT_LENGTH                                  0x2
#define _CKPPS_PORT_MASK                                    0x18
#define _CKPPS_TX1CKPPS_POSN                                0x0
#define _CKPPS_TX1CKPPS_POSITION                            0x0
#define _CKPPS_TX1CKPPS_SIZE                                0x5
#define _CKPPS_TX1CKPPS_LENGTH                              0x5
#define _CKPPS_TX1CKPPS_MASK                                0x1F
#define _CKPPS_TX1CKPPS0_POSN                               0x0
#define _CKPPS_TX1CKPPS0_POSITION                           0x0
#define _CKPPS_TX1CKPPS0_SIZE                               0x1
#define _CKPPS_TX1CKPPS0_LENGTH                             0x1
#define _CKPPS_TX1CKPPS0_MASK                               0x1
#define _CKPPS_TX1CKPPS1_POSN                               0x1
#define _CKPPS_TX1CKPPS1_POSITION                           0x1
#define _CKPPS_TX1CKPPS1_SIZE                               0x1
#define _CKPPS_TX1CKPPS1_LENGTH                             0x1
#define _CKPPS_TX1CKPPS1_MASK                               0x2
#define _CKPPS_TX1CKPPS2_POSN                               0x2
#define _CKPPS_TX1CKPPS2_POSITION                           0x2
#define _CKPPS_TX1CKPPS2_SIZE                               0x1
#define _CKPPS_TX1CKPPS2_LENGTH                             0x1
#define _CKPPS_TX1CKPPS2_MASK                               0x4
#define _CKPPS_TX1CKPPS3_POSN                               0x3
#define _CKPPS_TX1CKPPS3_POSITION                           0x3
#define _CKPPS_TX1CKPPS3_SIZE                               0x1
#define _CKPPS_TX1CKPPS3_LENGTH                             0x1
#define _CKPPS_TX1CKPPS3_MASK                               0x8
#define _CKPPS_TX1CKPPS4_POSN                               0x4
#define _CKPPS_TX1CKPPS4_POSITION                           0x4
#define _CKPPS_TX1CKPPS4_SIZE                               0x1
#define _CKPPS_TX1CKPPS4_LENGTH                             0x1
#define _CKPPS_TX1CKPPS4_MASK                               0x10

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0x1F10);
#ifndef _LIB_BUILD
asm("RA0PPS equ 01F10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS                 :6;
    };
    struct {
        unsigned RA0PPS0                :1;
        unsigned RA0PPS1                :1;
        unsigned RA0PPS2                :1;
        unsigned RA0PPS3                :1;
        unsigned RA0PPS4                :1;
        unsigned RA0PPS5                :1;
    };
} RA0PPSbits_t;
